backend/test/stress/vote-concurrent.yml
config:
  target: "http://localhost:3000"
  engines:
    socketio-v3: {}
  phases:
    - duration: 2
      arrivalRate: 250
      name: "Disparo masivo — 500 usuarios en 2 segundos"
  variables:
    TOKEN_SALA: "REEMPLAZAR_CON_TOKEN_REAL"
    SALA_ID: 1
    RONDA_ID: 1
    PREGUNTA_ID: 1

scenarios:
  - name: "Audiencia completa vota simultáneamente"
    engine: socketio-v3
    flow:
      - emit:
          channel: "unirse_sala"
          data:
            tokenCompartido: "{{ TOKEN_SALA }}"
            nombre: "concurrent_{{ $randomNumber(1, 9999999) }}"

      - emit:
          channel: "audience:vote"
          data:
            salaId: "{{ SALA_ID }}"
            rondaId: "{{ RONDA_ID }}"
            tokenCompartido: "{{ TOKEN_SALA }}"
            preguntaId: "{{ PREGUNTA_ID }}"
            participanteId: "{{ $randomNumber(1, 9999999) }}"
            opcionId: "{{ $randomNumber(1, 4) }}"

      - think: 3